<?php
defined('BASEPATH') OR exit('No direct script access allowed');

/**
 * 錯誤代碼
 * 
 *
 */

$config['error_code'] = array(
	1000 => '無錯誤',
	4001 => '參數錯誤導致系統作業失敗',
	4002 => '取得資料失敗',
	5001 => '商品已經沒庫存了',
	5002 => '商品庫存量小於購買數量',
	5003 => '商品庫存量扣除失敗',
	5004 => '讀取商品的明細時發生錯誤',
	5005 => '寫入CI cart失敗',
	5006 => '轉換color或degree ID失敗',
	// 5101 => '清除購物車商品失敗',  //CI cart 清除購物車不會返回值
	5102 => '刪除購物車商品失敗',
	5103 => '修改購務車數量失敗',
	6001 => '訂單資料輸入錯誤',
	6002 => '訂單必要欄位未輸入',
	6003 => '訂單寫入資料庫失敗',
	6101 => '金流帶入資料錯誤',
	6102 => '金流寫入資料庫失敗',
	6103 => '訂單信件寄送失敗',
	9999 => '未知的錯誤',
);